In [7]:
#Este moudlo se uso para cargar el data csv y analizarlo
import pandas as pd

df = pd.read_csv("data_prueba_t√©cnica.csv")

In [8]:
# Mirar 5 primeros elementos y 5 fianles
df_1 = pd.concat((df.head(), df.tail()))
print(df_1)

                                            id        name  \
0     48ba4bdbfb56ceebb32f2bd0263e759be942af3d  MiPasajefy
1     05fc6f5ac66b6ee7e4253aa5d0c2299eb47aaaf4  MiPasajefy
2     2cdce231c1fc6a2061bfa2f1d978351fe217245d  MiPasajefy
3     81633ba310a50b673efd469c37139576982901aa  MiPasajefy
4     6ccfc4c24e788e4bca448df343698782db6b0c0b  MiPasajefy
9995  4907c36c037bfa4874047e14f722329016dc3908  MiPasajefy
9996  ef9ec85887418d2ccf220686312cfc4c615665d5  MiPasajefy
9997  50bb3950ecde94ca3e07853003a11a413508da36  MiPasajefy
9998  1b2c4e503a4a952064b70369cf8e72937c720474  MiPasajefy
9999  4e85c4eac968c9465fc8d34bcd4968ac019fa850  MiPasajefy

                                    company_id  amount           status  \
0     cbf1c8b09cd5b549416d49d220a40cbd317f952e    3.00           voided
1     cbf1c8b09cd5b549416d49d220a40cbd317f952e    3.00  pending_payment
2     cbf1c8b09cd5b549416d49d220a40cbd317f952e    3.00           voided
3     cbf1c8b09cd5b549416d49d220a40cbd317f952e  102.61             paid
4     cbf1c8b09cd5b549416d49d220a40cbd317f952e  184.49             paid
9995  cbf1c8b09cd5b549416d49d220a40cbd317f952e   59.88             paid
9996  cbf1c8b09cd5b549416d49d220a40cbd317f952e   23.05             paid
9997  cbf1c8b09cd5b549416d49d220a40cbd317f952e   20.50             paid
9998  cbf1c8b09cd5b549416d49d220a40cbd317f952e   81.42             paid
9999  cbf1c8b09cd5b549416d49d220a40cbd317f952e   33.45             paid

      created_at     paid_at
0     2019-03-19         NaN
1     2019-05-06         NaN
2     2019-02-22         NaN
3     2019-02-27  2019-02-27
4     2019-02-05  2019-02-05
9995  2019-03-14  2019-03-14
9996  2019-02-20  2019-02-20
9997  2019-03-19  2019-03-19
9998  2019-03-10  2019-03-10
9999  2019-03-16  2019-03-17

In [9]:
#Contar cuantos Nan o Nat hay
nan_count = df.isna().sum()
print(nan_count)

id               3
name             3
company_id       4
amount           0
status           0
created_at       0
paid_at       3991
dtype: int64

In [10]:
# porcnetjae por columna
(df.isna().mean() * 100).round(2)

id             0.03
name           0.03
company_id     0.04
amount         0.00
status         0.00
created_at     0.00
paid_at       39.91
dtype: float64

In [ ]:
# Veriricar manualmente las filas nulas
df[df["id"].isna()]
df[df["name"].isna()]
#df[df["company_id"].isna()]
#df[df["amount"].isna()]
#df[df["status"].isna()]
#df[df["created_at"].isna()]
#df[df["paid_at"].isna()]

Separacion de datos

,id,name,company_id,amount,status,created_at,paid_at
731,ec79a21ef969c7fc6beef080ff56baf0aeeca8b5,NaN,cbf1c8b09cd5b549416d49d220a40cbd317f952e,112.52,paid,2019-02-14,2019-02-14
2199,6a6ac16d53a02ba7948bff0a534e45404e716c5b,NaN,cbf1c8b09cd5b549416d49d220a40cbd317f952e,244.88,voided,2019-05-09,NaN
2200,4740cf2624c3b929d9944cdfcb5c87e71a82ddc5,NaN,cbf1c8b09cd5b549416d49d220a40cbd317f952e,118.78,paid,2019-03-05,2019-03-06

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          9997 non-null   object
 1   name        9997 non-null   object
 2   company_id  9996 non-null   object
 3   amount      10000 non-null  float64
 4   status      10000 non-null  object
 5   created_at  10000 non-null  object
 6   paid_at     6009 non-null   object
dtypes: float64(1), object(6)
memory usage: 547.0+ KB